; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v12)
             (pred_7 ?v8 ?v9)
             (pred_4 ?v1 ?v9)
             (pred_11 ?v5 ?v1 )
	     (pred_3 ?v1)
             (pred_6 ?v13)
             (pred_12 ?v8)
             (pred_1 ?v9)
             (pred_9 ?v1)
             (pred_10 ?v8)
             (pred_8 ?v1)
             (pred_5 ))



(:action op_4
:parameters (?v2 ?v3 ?v6 ?v11)
:precondition (and (pred_6 ?v2) (pred_6 ?v3) (pred_12 ?v6) (pred_1 ?v11)
          (pred_2 ?v2 ?v3) (pred_7 ?v6 ?v11)
                   (pred_4 ?v3 ?v11) (pred_3 ?v2) 
                   (pred_9 ?v3) (pred_10 ?v6))
:effect (and  (pred_8 ?v3) (not (pred_9 ?v3))))


(:action op_1
:parameters (?v2 ?v4)
:precondition (and (pred_6 ?v2) (pred_6 ?v4)
               (pred_3 ?v2) (pred_2 ?v2 ?v4) (pred_8 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v2))))

(:action op_5
:parameters (?v2 ?v6)
:precondition (and (pred_6 ?v2) (pred_12 ?v6) 
                  (pred_3 ?v2) (pred_11 ?v6 ?v2) (pred_5 ))
:effect (and (pred_10 ?v6)
   (not (pred_11 ?v6 ?v2)) (not (pred_5 ))))


(:action op_2
:parameters (?v2 ?v10 ?v7)
:precondition (and (pred_6 ?v2) (pred_12 ?v10) (pred_12 ?v7)
                  (pred_3 ?v2) (pred_10 ?v7) (pred_11 ?v10 ?v2))
:effect (and (pred_10 ?v10) (pred_11 ?v7 ?v2)
        (not (pred_10 ?v7)) (not (pred_11 ?v10 ?v2))))

(:action op_3
:parameters (?v2 ?v6)
:precondition (and (pred_6 ?v2) (pred_12 ?v6) 
                  (pred_3 ?v2) (pred_10 ?v6))
:effect (and (pred_5 ) (pred_11 ?v6 ?v2) (not (pred_10 ?v6)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_13 obj_01 obj_05 obj_11 obj_02 obj_09 obj_08 obj_06
    obj_07 obj_04
    obj_12 obj_03
    )

    (:init
       (pred_5)

       (pred_6 obj_10)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_04)
       (pred_12 obj_12)
       (pred_12 obj_03)

       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_11 obj_08)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_06 obj_08)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_4  obj_06 obj_07)
       (pred_4  obj_09 obj_04)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_08)

       (pred_7  obj_12 obj_07)
       (pred_7  obj_03 obj_04)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_03 obj_05)
       (pred_3 obj_08)
    )

    (:goal (and
       (pred_11 obj_12 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_1 obj_08 obj_11)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_05)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_05)
   goals met: 0 of 1
3. (op_1 obj_05 obj_10)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_12)
   deleted: (pred_11 obj_12 obj_10) (pred_5)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_1 obj_10 obj_05)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_05)
   goals met: 0 of 1
6. (op_1 obj_05 obj_11)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_11)
   goals met: 0 of 1
7. (op_3 obj_11 obj_12)
   deleted: (pred_10 obj_12)
   added: (pred_5) (pred_11 obj_12 obj_11)
   goals met: 1 of 1
